Диплом/src/Documents/ТорговляЩитами/ТорговляЩитами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТорговляЩитами</name>
  <registerRecords>AccumulationRegister.РегистрВзаиморасчетов</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиМатериаловИТоваров</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПродажи</name>
    <type>
      <types>DocumentRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура_Щита</name>
      <type>
        <types>CatalogRef.ДеревянныеЩиты_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом/src/AccumulationRegisters/ОстаткиМатериаловИТоваров/ОстаткиМатериаловИТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиМатериаловИТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.РасходникиДляПроизводства_Номенклатура</types>
      <types>CatalogRef.ДеревянныеЩиты_Номенклатура</types>
      <types>CatalogRef.ЛесСырьё_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.Помещения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Диплом/src/AccountingRegisters/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Управленческий</name>
  <chartOfAccounts>ChartOfAccounts.Основной</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Основной.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Основной.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
</mdclass:AccountingRegister>

Диплом/src/AccumulationRegisters/РегистрВзаиморасчетов/РегистрВзаиморасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РегистрВзаиморасчетов</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Диплом/src/ChartsOfAccounts/Основной/Основной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Основной</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Материалы</name>
      <description>Материалы</description>
      <code>10</code>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
    </items>
    <items>
      <name>РасчетыСПоставщиками</name>
      <description>Расчеты с поставщиками</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ДебиторскаяЗадолженность</name>
      <description>Дебиторская задолженность</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Капитал</name>
      <description>Капитал</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Диплом/src/Documents/ТорговляЩитами/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Сумма = Товары.Итог("Сумма");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
    	// регистр ОстаткиМатериаловИТоваров Расход
	Движения.ОстаткиМатериаловИТоваров.Записывать = Истина; 
	Движения.ОстаткиМатериаловИТоваров.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
    "ВЫБРАТЬ
	|	ТорговляЩитамиТовары.Номенклатура_Щита,
	|	СУММА(ТорговляЩитамиТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ДокТЧС
	|ИЗ
	|	Документ.ТорговляЩитами.Товары КАК ТорговляЩитамиТовары
	|ГДЕ
	|	ТорговляЩитамиТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТорговляЩитамиТовары.Номенклатура_Щита
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокТЧС.Номенклатура_Щита,
	|	ДокТЧС.Количество
	|ИЗ
	|	ДокТЧС КАК ДокТЧС";  
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ОстаткиМатериаловИТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура_Щита;
		Движение.Помещение = Помещение;
		Движение.Количество = Выборка.Количество;
		
	КонецЦикла;
	
	Движения.Записать();
	
	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	ОстаткиМатериаловИТоваровОстатки.Номенклатура,
	 |	ОстаткиМатериаловИТоваровОстатки.КоличествоОстаток
	 |ИЗ
	 |	РегистрНакопления.ОстаткиМатериаловИТоваров.Остатки(&МоментВремени, Помещение = &Помещение И Номенклатура В (Выбрать ДокТЧС.Номенклатура_Щита ИЗ ДокТЧС КАК ДокТЧС)) КАК ОстаткиМатериаловИТоваровОстатки
	 |ГДЕ
	 |	ОстаткиМатериаловИТоваровОстатки.КоличествоОстаток < 0";  
	
	 Граница = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	
	Запрос.УстановитьПараметр("МоментВремени", Граница);
	Запрос.УстановитьПараметр("Помещение", Помещение);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			 Сообщить("Мало товара "+ Выборка.Номенклатура +", нужно еще " + (-Выборка.КоличествоОстаток));
		КонецЦикла;	
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Основной.Товары;
		Движение.СчетКт = ПланыСчетов.Основной.ДебиторскаяЗадолженность;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.КоличествоДт = ТекСтрокаТовары.Количество;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Материалы] = ТекСтрокаТовары.Номенклатура_Щита;
	КонецЦикла;
	
	// регистр РегистрВзаиморасчетов Приход
	Движения.РегистрВзаиморасчетов.Записывать = Истина;
	Движение = Движения.РегистрВзаиморасчетов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Организация = Организация; 
	Движение.Контрагент = Контрагент;
	Движение.Сумма = Сумма;

КонецПроцедуры
